// geometry.js - Definição dos 4 Triângulos (12 Vértices)

export const vertexData = new Float32Array([
  // --- TRIÂNGULO 0: Pipa Esquerda (Vermelho) ---
  // x,     y,    z,      r,    g,    b,    a
  -0.45,  0.0, 0.0,   0.90, 0.15, 0.15, 1.0,
   0.00,  0.4, 0.0,   0.90, 0.15, 0.15, 1.0,
   0.00, -0.65, 0.0,  0.90, 0.15, 0.15, 1.0,

  // --- TRIÂNGULO 1: Pipa Direita (Amarelo) ---
   0.00,  0.4, 0.0,   0.95, 0.80, 0.10, 1.0,
   0.45,  0.0, 0.0,   0.95, 0.80, 0.10, 1.0,
   0.00, -0.65, 0.0,  0.95, 0.80, 0.10, 1.0,

  // --- TRIÂNGULO 2: Fita 1 da Cauda (Laranja) ---
  // Bico para cima (0,0) e base reta para baixo (-0.15 a 0.15 em y=-0.35)
   0.00,  0.00, 0.0,  0.95, 0.50, 0.10, 1.0,
  -0.12, -0.35, 0.0,  0.95, 0.50, 0.10, 1.0,
   0.12, -0.35, 0.0,  0.95, 0.50, 0.10, 1.0,

  // --- TRIÂNGULO 3: Fita 2 da Cauda (Laranja) ---
   0.00,  0.00, 0.0,  0.95, 0.50, 0.10, 1.0,
  -0.12, -0.35, 0.0,  0.95, 0.50, 0.10, 1.0,
   0.12, -0.35, 0.0,  0.95, 0.50, 0.10, 1.0,
]);